
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Поле33 = ТП.Область("R1C1:R3C3");
	
	Поле33.ШиринаКолонки 	= 5;
	Поле33.ВысотаСтроки 	= 25;
	Поле33.ВертикальноеПоложение 	= ВертикальноеПоложение.Центр;
	Поле33.ГоризонтальноеПоложение 	= ГоризонтальноеПоложение.Центр;
	Поле33.ЦветФона 				= Новый Цвет(230, 230, 230);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьНовуюИгру();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТП

&НаКлиенте
Процедура ТПВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если МожноХодить Тогда
		ТП.Область(Элемент.ТекущаяОбласть.Имя).Текст = "0";
		МожноХодить = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьНовуюИгру()	
	
	ТекстНачала = "Выпало 2, Компьютер ходит первый!";
	ПоказатьПредупреждение(, ТекстНачала, 2.5,);
	ПодключитьОбработчикОжидания("ОболочкаОбработчика", 1, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОболочкаОбработчика()
	
	ПроверяемоеПоле = "R0C0";
	ПроверяемаяСтрока = 0;
	ПроверяемаяКолонка = 1;
	ТекХод = 1;
	Пока ПроверяемоеПоле <> "R3C3" Цикл 
		Если ПроверяемаяСтрока = 3 Тогда
			ПроверяемаяСтрока = 1;
			ПроверяемаяКолонка = ПроверяемаяКолонка + 1;
		Иначе
			ПроверяемаяСтрока = ПроверяемаяСтрока + 1;
		КонецЕсли;
		ПроверяемоеПоле = "R" + ПроверяемаяСтрока + "C" + ПроверяемаяКолонка;
		Если ЗначениеЗаполнено(ТП.Область(ПроверяемоеПоле).Текст) Тогда
			ТекХод = ТекХод + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекХод = 1 И НЕ ЗначениеЗаполнено(ТП.Область("R2C2").Текст) Тогда
		ТП.Область("R2C2").Текст = "Х";
	КонецЕсли;
	
	Если ТекХод = 3 Тогда
		
		Если ТП.Область("R2C1").Текст = "0" Тогда
			ИИПобедил = Истина;
			ТП.Область("R1C1").Текст = "Х";
		ИначеЕсли ТП.Область("R2C3").Текст = "0" Тогда
			ИИПобедил = Истина;
			ТП.Область("R1C3").Текст = "Х";
		ИначеЕсли ТП.Область("R1C2").Текст = "0" Тогда
			ИИПобедил = Истина;
			ТП.Область("R1C1").Текст = "Х";
		ИначеЕсли ТП.Область("R3C2").Текст = "0" Тогда
			ИИПобедил = Истина;
			ТП.Область("R3C1").Текст = "Х";
		Иначе
			ИИВНичье = Истина;
			Если ТП.Область("R1C1").Текст = "0"
				ИЛИ ТП.Область("R3C3").Текст = "0" Тогда
				ТП.Область("R1C3").Текст = "Х";
			ИначеЕсли ТП.Область("R1C3").Текст = "0"
				ИЛИ ТП.Область("R3C1").Текст = "0" Тогда
				ТП.Область("R1C1").Текст = "Х";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекХод = 5 Тогда 
		
		Если ИИПобедил Тогда
			Если ТП.Область("R2C1").Текст = "0"
				ИЛИ ТП.Область("R2C3").Текст = "0" Тогда
				ТП.Область("R1C2").Текст = "Х";
			ИначеЕсли ТП.Область("R1C2").Текст = "0"
				ИЛИ ТП.Область("R3C2").Текст = "0" Тогда
				ТП.Область("R2C1").Текст = "Х";
			КонецЕсли;    
		Иначе
			
			Если ТП.Область("R3C1").Текст = "0"
				И ТП.Область("R3C3").Текст = "0" Тогда
				ТП.Область("R3C2").Текст = "Х";
			ИначеЕсли ТП.Область("R1C1").Текст = "0"
				И ТП.Область("R3C1").Текст = "0" Тогда
				ТП.Область("R2C1").Текст = "Х";
			ИначеЕсли ТП.Область("R1C3").Текст = "0"
				И ТП.Область("R3C3").Текст = "0" Тогда
				ТП.Область("R2C3").Текст = "Х";
			Иначе
				
				Если ТП.Область("R3C1").Текст = "0"
					ИЛИ ТП.Область("R1C3").Текст = "0" Тогда
					ТП.Область("R3C3").Текст = "Х";
				ИначеЕсли ТП.Область("R3C3").Текст = "0"
					ИЛИ ТП.Область("R1C1").Текст = "0" Тогда
					ТП.Область("R3C1").Текст = "Х";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекХод = 7 Тогда 
		
		Если ИИПобедил Тогда
			
			Если ТП.Область("R1C2").Текст = "Х" Тогда
				
				Если ТП.Область("R3C2").Текст = "0" Тогда
					ТП.Область("R1C1").Текст = "Х";
				Иначе
					ТП.Область("R3C2").Текст = "Х";
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТП.Область("R2C1").Текст = "Х" Тогда
				
				Если ТП.Область("R2C3").Текст = "0" Тогда
					ТП.Область("R3C1").Текст = "Х";
				Иначе
					ТП.Область("R2C3").Текст = "Х";
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ТП.Область("R1C1").Текст = "0"
				И ТП.Область("R3C1").Текст = "0"
				И НЕ ЗначениеЗаполнено(ТП.Область("R2C3").Текст) Тогда
				ТП.Область("R2C3").Текст = "Х";
			ИначеЕсли ТП.Область("R1C3").Текст = "0"
				И ТП.Область("R3C3").Текст = "0" 
				И НЕ ЗначениеЗаполнено(ТП.Область("R2C1").Текст) Тогда
				ТП.Область("R2C1").Текст = "Х";
			ИначеЕсли ТП.Область("R3C1").Текст = "0"
				И ТП.Область("R3C3").Текст = "0" 
				И НЕ ЗначениеЗаполнено(ТП.Область("R1C2").Текст) Тогда
				ТП.Область("R1C2").Текст = "Х";
			Иначе
				
				Если (ТП.Область("R1C1").Текст = "0"
					И ТП.Область("R3C1").Текст = "0")
					ИЛИ (ТП.Область("R1C3").Текст = "0"
					И ТП.Область("R3C3").Текст = "0") Тогда
					ТП.Область("R3C2").Текст = "Х";
				Иначе
					ТП.Область("R2C1").Текст = "Х";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекХод = 9 Тогда
		
		ПроверяемоеПоле = "R0C0";
		ПроверяемаяСтрока = 0;
		ПроверяемаяКолонка = 1;
		ТекХод = 1;
		Пока ПроверяемоеПоле <> "R3C3" Цикл 
			Если ПроверяемаяСтрока = 3 Тогда
				ПроверяемаяСтрока = 1;
				ПроверяемаяКолонка = ПроверяемаяКолонка + 1;
			Иначе
				ПроверяемаяСтрока = ПроверяемаяСтрока + 1;
			КонецЕсли;
			ПроверяемоеПоле = "R" + ПроверяемаяСтрока + "C" + ПроверяемаяКолонка;
			Если НЕ ЗначениеЗаполнено(ТП.Область(ПроверяемоеПоле).Текст) Тогда
				ТП.Область(ПроверяемоеПоле).Текст = "Х";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	МожноХодить = Истина;
	
КонецПроцедуры

#КонецОбласти
